apojomovsky/epic-hal/pic16f63x_67x_68x-hal/tests/example_blink.c
/* Blink an LED from a Timer0 overflow: the canonical "the HAL
 * drives a real application" smoke test. Wiring: LED+resistor between
 * the blink pin and GND, internal oscillator (INTRCIO, 4 MHz POR).
 * Timer0 Fosc/4, 1:256 prescaler, reload 0, overflows every ~16 ms
 * (~30 Hz toggle). The blink pin is RB4 on 20-pin parts; PORTB does
 * not exist on the 14-pin shapes, which blink RA0 instead. */

#include "pic16f63x_67x_68x_hal.h"
#include "pic16f63x_67x_68x_sfr.h"
#include "peripherals/pic16f63x_67x_68x_gpio.h"
#include "peripherals/pic14_timer0.h"
#include "core/pic16_irq.h"
#include "core/pic14_wdt_sleep.h"
#include "core/epic_harness.h"

/** Simulated run length (host only). 256 × 256 = 65536 cycles per Timer0
 *  overflow at 1:256, so 600k cycles give ~9 toggles. */
#define SIM_CYCLES  600000UL

/* Toggle count, the ISR is the only writer. Narrow type: the 64 B RAM
 * budget is the tightest in the tree. */
static volatile uint16_t g_toggle_count = 0;

/* Timer0 overflow callback, runs in interrupt context (target) or the
 * sim IRQ callback (host). The pin toggles through a direct latch RMW:
 * the driver call path in the ISR partition tips the 64 B RAM
 * allocation over the limit (adding-a-device §3.2); main and the bank
 * probe gate still cover the GPIO driver paths. */
/**
 * @brief Toggle RB4 and bump the toggle counter on each Timer0 overflow.
 */
static void on_t0_overflow(void)
{
#if PIC16F63X_67X_68X_FAMILY_HAS_PORTB
    EPIC_REG8(PIC_REG_PORTB) ^= GPIO_PIN_4;
#else
    EPIC_REG8(PIC_REG_PORTA) ^= GPIO_PIN_0;
#endif
    g_toggle_count++;
}

/**
 * @brief Blink RB4 from a Timer0 overflow-driven loop.
 */
int main(void)
{
    epic_harness_init(SIM_CYCLES);

    /* 1. Blink pin as output, start low. */
#if PIC16F63X_67X_68X_FAMILY_HAS_PORTB
    EPIC_GPIO_Init(GPIOB, GPIO_PIN_4, GPIO_MODE_OUTPUT);
    EPIC_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_RESET);
#else
    EPIC_GPIO_Init(GPIOA, GPIO_PIN_0, GPIO_MODE_OUTPUT);
    EPIC_GPIO_WritePin(GPIOA, GPIO_PIN_0, GPIO_PIN_RESET);
#endif

    /* 2. Timer0: internal Fosc/4, 1:256 prescaler, reload 0, toggle on
     *    each overflow. Local handle: Init/Start are header inlines, so
     *    clang folds the callback store to a named literal and epic-cc
     *    resolves the ISR dispatch (ADR-024). */
    TIMER0_HandleTypeDef h = TIMER0_HANDLE_DEFAULT;
    h.ClockSource       = TIMER0_CLOCK_INTERNAL;
    h.Prescaler         = TIMER0_PRESCALER_1_256;
    h.PrescalerAssigned = true;
    h.ReloadValue       = 0x00U;
    h.OverflowCallback  = on_t0_overflow;
    EPIC_TIMER0_Init(&h);
    EPIC_TIMER0_Start(&h);

    /* 3. Arm the Timer0 interrupt (EPIC_TIMER0_Init set TMR0IE; now set GIE).
     *    On the sim the IRQ fires regardless, so this is harmless there. */
    EPIC_IRQ_Restore(1);

    /* 4. Let time pass: the harness bounds the loop on the host and
     *    pumps the sim each iteration (no-op on target, where real
     *    time advances on its own). WDT refresh is a host no-op, so it
     *    is called unconditionally. */
    for (uint32_t i = 0; epic_harness_running(i); i++)
    {
        epic_harness_tick();
        EPIC_WDT_Refresh();
    }

#ifdef __EPIC_CC__
    /* epic-cc isel gaps, both filed: a const global as a pointer call
     * argument (epic-cc#148) and a select between two string globals
     * (epic-cc#147). The callback-driven loop above is shared. */
    (void)g_toggle_count;
    return 0;
#else
    epic_harness_log("blink toggled %u times.\n", (unsigned)g_toggle_count);
    return epic_harness_report(g_toggle_count >= 2U);
#endif
}
